##################################################################################
# Task_1
# 1. Простой числовой треугольник

def Task_1():
    rows = 6
    for num in range(rows):
        for i in range(num):
            print(num, end=" ")  # вывод числа
        # вывод пустой строки после каждой строки с числами для правильного отображения шаблона
        print(" ")

# Task_1()

##################################################################################
# Task_2
# 2. Обратный числовой треугольник

def Task_2():
    rows = 5
    b = 0
    for i in range(rows, 0, -1):
        b += 1
        for j in range(1, i + 1):
            print(b, end=' ')
        print('\r')

# Task_2()

##################################################################################
# Task_3
# Сумма текущего и предыдущего числа

def Task_3():
    print('Печать текущей и предыдущей суммы чисел в диапазоне (10)')
    num_prev = 0

    for i in range(0,11):
        x_sum = num_prev + i
        num_prev = i
        print(f'Текущее число {i},предыдущее число {num_prev}, сумма чисел {x_sum}')

# Task_3()

##################################################################################
# Task_4
# Вычислите умножение и сумму двух чисел

def Task_4():
    a = int(input())
    b = int(input())

    def product(num1, num2):
        resultum = num1 * num2
        if resultum >= 1000:
            print(resultum)
        else:
            print(num1 + num2)

    product(a, b)

# Task_4()

##################################################################################
# Task_5
# Четные символы строки

def Task_5():
    print('Печать текущей и предыдущей суммы чисел в диапазоне (10)')
    str = input()
    strlen = len(str)

    for i in range(0, strlen, 2):
        print(str[i])

# Task_5()

##################################################################################
# Task_6
# Удалить первые символы строки python

def Task_6():
    str = input('Введите строку: ')
    strremove = int(input('Введите количество символов для удаления: '))

    def wordstr(str, n):
        x = str[n:]
        print(x)

    wordstr(str, strremove)

# Task_6()

##################################################################################
# Task_7
# Совпадает ли первый и последний номер в списке?

def Task_7():
    list = [10, 20, 30, 40, 50, 30]
    print(list[0], 'Значение первого индекса')
    print(list[-1], 'Значение последнего индекса')

    def listsearch(list):
        if list[0] == list[-1]:
            print(True)
        else:
            print(False)

    listsearch(list)

# Task_7()

##################################################################################
# Task_8
# Вывести из списка числа, кратные 5

def Task_8():
    list = [10, 20, 16, 40, 21, 30]

    def listx(list):
        for i in list:
            if i % 5 == 0:
                print(i)

    listx(list)

# Task_8()
##################################################################################
# Python вхождение подстроки в строку
def Task_9():
    str_x = "Вася хороший программист. Будь как Вася"
    count = 0
    xstr = str_x.split()
    for i in xstr:
        if i == 'Вася':
            count = count + 1
    print(f'Вася появился в строке {count} раз')

# Task_9()

##################################################################################
# Task_10
# Распечатайте цифры вот так
# 1
# 2 2
# 3 3 3
# 4 4 4 4
# 5 5 5 5 5
def Task_10():
    for i in range(1, 10):
        for j in range(i):
            print(i, end=' ')
        print('\n')

# Task_10()
# :) or :| or :(